In [1]:
import pandas as pd
import matplotlib.pyplot as plt
pd.options.display.max_columns = 999
pd.options.display.max_rows=999

import seaborn as sns
df = sns.load_dataset("titanic")

In [2]:
print(df.shape)
print(df.info())
display(df.head())

(891, 15)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
None

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### １．

In [3]:
df = df.drop(columns="deck")

In [4]:
df = df.dropna()

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 712 entries, 0 to 890
Data columns (total 14 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     712 non-null    int64
 1   pclass       712 non-null    int64
 2   sex          712 non-null    object
 3   age          712 non-null    float64
 4   sibsp        712 non-null    int64
 5   parch        712 non-null    int64
 6   fare         712 non-null    float64
 7   embarked     712 non-null    object
 8   class        712 non-null    category
 9   who          712 non-null    object
 10  adult_male   712 non-null    bool
 11  embark_town  712 non-null    object
 12  alive        712 non-null    object
 13  alone        712 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(5)
memory usage: 69.0+ KB
None

### 2.

In [6]:
print("{:.3f}".format(df["survived"].mean()))

0.404

### 3.

In [7]:
print(df["pclass"].value_counts())

pclass
3    355
1    184
2    173
Name: count, dtype: int64

### 4.

In [8]:
display(df.groupby("survived").mean(numeric_only=True))

,pclass,age,sibsp,parch,fare,adult_male,alone
survived,,,,,,,
0,2.485849,30.626179,0.525943,0.365566,22.965456,0.804245,0.646226
1,1.878472,28.193299,0.496528,0.531250,51.647672,0.250000,0.444444

### 5.

In [9]:
display(pd.crosstab(df["survived"], df["class"]))

class     First  Second  Third
survived
0            64      90    270
1           120      83     85

### 6.

In [10]:
display(pd.crosstab(df["survived"], df["adult_male"],normalize="all", margins=True))

adult_male     False      True       All
survived
0           0.116573  0.478933  0.595506
1           0.303371  0.101124  0.404494
All         0.419944  0.580056  1.000000

### 7.

In [11]:
display(df.pivot_table(index="survived", columns="sex", values="fare", aggfunc="mean"))

sex          female       male
survived
0         22.771877  22.999871
1         55.393334  43.793865

### 8.

In [12]:
display(df.pivot_table(index="sex", columns="class", values="survived", aggfunc="sum"))

C:\Users\iniad\AppData\Local\Temp\ipykernel_12160\2456918746.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  display(df.pivot_table(index="sex", columns="class", values="survived", aggfunc="sum"))

class   First  Second  Third
sex
female     80      68     47
male       40      15     38